// NMEC: 113384

# Lab04 - Ex 4.2

## 1. Encontre todos os atores que dirigiram um filme em que também atuaram e apresente o nome do ator e o título do filme.
```sql
MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie)<-[:DIRECTED]-(actor)
RETURN actor.name AS Actor, movie.title as Movie
```

## 2. Para cada filme realizado depois de 2005, apresente os nomes de todos os atores que atuaram nesse filme.
```sql
MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie)
WHERE movie.released > 2005
RETURN movie.title AS Movie, collect(actor.name) AS Actors
```

## 3. Encontre pares de nós com mais do que uma relação entre si.
```sql
MATCH (a)-[r]->(b)
WITH a, b, COUNT(r) as relationCount
WHERE relationCount > 1
RETURN a, b, relationCount
```

## 4. Encontre todos os pares de pessoas que fizeram revisões do mesmo filme. Apresente os seus nomes e título de cada filme.
```sql
MATCH (person1:Person)-[:REVIEWED]->(movie:Movie)<-[:REVIEWED]-(person2:Person)
RETURN person1.name As Reviewer1, person2.name AS Reviewer2, movie.title as Movie
```

**Question:** Results are like: Reviewer1 (a) Reviewer2 (b) Movie(m)
                                Reviewer2 (b) Reviewer1 (a) Movie(m)

## 5. Encontre todos os pares de atores que atuaram em vários filmes juntos.
```sql
MATCH (actor1:Person)-[:ACTED_IN]->(movie:Movie)<-[:ACTED_IN]-(actor2:Person)
WITH actor1, actor2, COUNT(movie) AS sharedActedMovies
WHERE sharedActedMovies > 1
RETURN actor1.name AS Actor1, actor2.name AS Actor2, sharedActedMovies
```

**Question:** Same problem on 4.

## 6. Determine a idade média do elenco do filme "Apollo 13" no ano do lançamento do filme.
```Sql
MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie {title: "Apollo 13"})
RETURN avg(movie.released - actor.born) AS AverageAge
```

## 7. Encontre os 10 filmes com o elenco mais velho no momento do lançamento do filme. Apresente o filme e a idade média arredondada a 2 casas decimais, por ordem decrescente.
```sql
MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie)
WITH movie, avg(movie.released - actor.born) AS AverageAge
RETURN movie.title as Movie, round(AverageAge, 2) 
ORDER BY AverageAge DESC
LIMIT 10
```

## 8. Apresente o subgrafo ACTED_IN do filme com o elenco mais novo, no momento do lançamento do filme.
```sql
MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie)
WITH movie, avg(movie.released - actor.born) AS AverageAge
ORDER BY AverageAge ASC
LIMIT 1
MATCH (actor:Person)-[relation:ACTED_IN]->(movie:Movie)
RETURN actor, relation, movie
```

## 9. Qual é o caminho mais curto (usando qualquer tipo de relação) entre John Cusack e Demi Moore?
```sql
MATCH p = SHORTEST 1 (person1:Person {name: "John Cusack"})-[*]-(person2:Person {name: "Demi Moore"})
RETURN p
```

**Note:** I could RETURN [n in nodes(p) | coalesce(n.name, n.title) ] to see the path like ["node1", "node2", ...]
- The function coalesce returns the first non-null value in a list of expressions.

## 10. Qual a dimensão caminho mais curto (usando qualquer tipo de relação) entre Keanu Reeves e Tom Cruise?
```sql
MATCH p = SHORTEST 1 (person1:Person {name: "Keanu Reeves"})-[*]-(person2:Person {name: "Tom Cruise"})
RETURN length(p) AS PathLength
```

## 11. Quais são as dimensões do caminho mais curto entre pessoas com nome Jim e pessoas com nome Kevin?
```sql
MATCH p = SHORTEST 1 (person1:Person {name: "Jim"})-[*]-(person2:Person {name: "Kevin"})
RETURN length(p) AS PathLength
```

**Note:** no results? what are the differencees between this one and 11?

## 12. Que pessoas têm uma distância 2 para Jim Cash (a distância entre duas pessoas é o comprimento do caminho mais curto entre eles)?
```sql
MATCH p = SHORTEST 1 (jim:Person {name: "Jim Cash"})-[*2]-(otherPerson:Person)
RETURN otherPerson.name AS Person, length(p) AS PathLength
```

## 13. Qual é a maior distância de uma pessoa para Kevin Bacon?
```sql
MATCH p = (kevin:Person {name: "Kevin Bacon"})-[*]-(otherPerson:Person)
RETURN p
ORDER BY length(p) DESC
LIMIT 1
```

**Note:** No results???

## 14. Qual é a maior distância entre duas pessoas?
```sql
MATCH p = (person1:Person)-[*]-(person2:Person)
WHERE person1 <> person2
WITH person1, person2, max(length(p)) AS maxDistance
RETURN person1.name AS Person1, person2.name AS Person2, maxDistance
ORDER BY maxDistance DESC LIMIT 1
```

## 15. Qual é a distribuição de distâncias em pares (isto é, para a distância 1, 2, 3, ..., quantos pares de pessoas têm essa distância um do outro)?

## 16. Indique as 10 pessoas com menor distância média em que o caminho entre elas são relações do tipo ACTED_IN.

## 17. Apresente os atores que tiveram pelo menos uma role para personagens com o prefixo 'Dr.'. O resultado deve ser uma lista com o par “Ator, Lista das roles”.

## 18.

## 19.

## 20.