// NMEC: 113384

# Lab04 - Ex 4.3

## 0. Carregue o conteudo do ficheiro `/resouces/git_selection.csv`.
```sql
LOAD CSV WITH HEADERS FROM 'file:///resources/git_selection.csv' AS row
MERGE (user: User {svn_id: row.svn_id, real_name: row.real_name})
MERGE (org: Organization {name: row.organization})
MERGE (project: Project {name: row.project_name})
MERGE (user)-[:WORKS_ON]->(org)
MERGE (user)-[:CONTRIBUTES {num: toInteger(row.num), role: row.role_on_project}]->(project)
```

## 1. Liste a informação de cada utilizador.
```sql
MATCH (u:User)
RETURN u.svn_id AS svn_id, u.real_name AS real_name
```
    
## 2. Liste o nome de cada utilizador.
```sql
MATCH (u:User)
RETURN u.real_name AS real_name
```

## 3. Liste a informação de cada projeto, no qual tenha participado pelo menos um utilizador.
```sql
MATCH (p:Project)<-[:CONTRIBUTES]-(u:User)
RETURN p.name AS project_name
```

## 4. Liste os utilizadores e total de projetos em que cada um colabora.
```sql
MATCH (u:User)-[:CONTRIBUTES]->(p:Project)
RETURN u.real_name AS real_name, count(p) AS total_projects
```

## 5. Liste os utilizadores e do total de projetos em que cada colabora ordenados por ordem decrescente do total.
```sql
MATCH (u:User)-[:CONTRIBUTES]->(p:Project)
RETURN u.real_name AS real_name, count(p) AS total_projects
ORDER BY total_projects DESC
```

## 6. Liste projetos e total de membros em cada projeto.
```sql
MATCH (p:Project)<-[:CONTRIBUTES]-(u:User)
RETURN p.name AS project_name, count(u) AS total_members
```

## 7. Liste projetos e total de membros com a role "Committer" em cada projeto.
```sql
MATCH (p:Project)<-[:CONTRIBUTES {role: 'Committer'}]-(u:User)
RETURN p.name AS project_name, count(u) AS total_committers
```

## 8. Liste todos os utilizadores que participaram nos mesmo projetos do que o utilizador "atm" (id). Mostre os atributos: nome de "atm", nome utilizador 2, nome do projeto.
```sql
MATCH (u1:User {svn_id: 'atm'})-[:CONTRIBUTES]->(p:Project)<-[:CONTRIBUTES]-(u2:User)
RETURN u1.real_name AS atm, u2.real_name AS user2, p.name AS project_name
```

## 9. Liste todos os utilizadores que participaram com a role "Committer" em projetos em que o utilizador "atm" (id1) participou com a role "PMC".
```sql
MATCH (u1:User {svn_id: 'atm'})-[:CONTRIBUTES {role: 'PMC'}]->(p:Project)<-[:CONTRIBUTES {role: 'Committer'}]-(u2:User)
RETURN u1.real_name AS atm, u2.real_name AS user2, p.name AS project_name
```